Revit 2027 API
PointIterator.CurrentObject Property
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Object CurrentObject { get; }
Public ReadOnly Property CurrentObject As Object
	Get
public:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
abstract CurrentObject : Object with get
override CurrentObject : Object with get
Property Value
Object
Implements
IEnumerator.Current
See Also
Reference
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace